In [1]:
#create a 1D array and insert values from 0 to 20 within 3 gfap space and find the values which are divided by 2
#and replace 0 in array which are not satisfied the condition

In [2]:
import numpy as np
import pandas as pd

In [4]:
#series
s1=pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [6]:
s2=pd.Series([1,2,3],index=['a','b','c'])
s2

a    1
b    2
c    3
dtype: int64

In [7]:
import pandas as pd

In [8]:
#method1

In [11]:
data={'name':['ra','il','sach'],'age':[20,21,22]}
df=pd.DataFrame(data)
df

   name  age
0    ra   20
1    il   21
2  sach   22

In [14]:
#method2
#create a list of dictionaries
list_of_dict=[{'column_a':1,'coloumn_b':2,'coloumn_c':3},
             {'column_a':32,'coloumn_b':13,'coloumn_c':54}]
df=pd.DataFrame(list_of_dict
               )
df

   column_a  coloumn_b  coloumn_c
0         1          2          3
1        32         13         54

In [16]:
df1=pd.DataFrame(list_of_dict,index=['row1','row2'])
df1

      column_a  coloumn_b  coloumn_c
row1         1          2          3
row2        32         13         54

In [19]:
#method4
#createing dataframe using tuples
list_of_tuples=[(2,'july',1999),(23,'augest',2001)]

#creating the dataframe
df=pd.DataFrame(list_of_tuples,columns=['data','month','year'])
df

   data   month  year
0     2    july  1999
1    23  augest  2001

In [21]:
#method5
#creating by zip() function
import pandas as pd
#list1

students=['dev','ilma','asd']

#list2
age=[24,26,43,12]

#using zip to merge the list
details=list(zip(students,age))
df=pd.DataFrame(details,columns=['name','age'])
df

   name  age
0   dev   24
1  ilma   26
2   asd   43

In [22]:
print(df.shape)

(3, 2)

In [23]:
print(df.describe())

             age
count   3.000000
mean   31.000000
std    10.440307
min    24.000000
25%    25.000000
50%    26.000000
75%    34.500000
max    43.000000

In [24]:
print(df.columns)

Index(['name', 'age'], dtype='object')

In [25]:
print(df.values)

[['dev' 24]
 ['ilma' 26]
 ['asd' 43]]

In [26]:
import pandas as pd
name=['alice','bob','charlie','david','kal','apil','david']
age=[25,20,22,28,19,22,27]
score=[88,72,90,85,75,77,82]
city=['new york','los angels','turkey','colombo','london','oslo','london']
details=list(zip(name,age,score,city))
df=pd.DataFrame(details,columns=['name','age','score','city'])
df

      name  age  score        city
0    alice   25     88    new york
1      bob   20     72  los angels
2  charlie   22     90      turkey
3    david   28     85     colombo
4      kal   19     75      london
5     apil   22     77        oslo
6    david   27     82      london

In [37]:
#sorting rows with pandas dataframe
import pandas as pd
raw_data={'first_name':['sheldon','raj','leonard','fathima','any'],
         'last_name':['has','kumar','peter','rashidha','sina'],
         'age':[32,12,43,12,44],
         'comedy_score':[9,5,3,7,6],
         'rating_score':[25,25,43,23,65]}

df=pd.DataFrame(raw_data,columns=['first_name','last_name','age','comedy_score','rating_score'])
print(df)

  first_name last_name  age  comedy_score  rating_score
0    sheldon       has   32             9            25
1        raj     kumar   12             5            25
2    leonard     peter   43             3            43
3    fathima  rashidha   12             7            23
4        any      sina   44             6            65

In [38]:
print(df.sort_values(by='age',ascending=0))
print()

  first_name last_name  age  comedy_score  rating_score
4        any      sina   44             6            65
2    leonard     peter   43             3            43
0    sheldon       has   32             9            25
1        raj     kumar   12             5            25
3    fathima  rashidha   12             7            23